org/An_approximation_to_an_efficient_fundamental_physics_curriculum.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: An_approximation_to_an_efficient_fundamental_physics_curriculum
#+TITLE: An approximation to an efficient fundamental physics curriculum
#+roam_tags: projects learning physics

* keywords
- [[file:learning.org][learning]], [[file:physics.org][physics]]
* outline
** see the latex / pdf version of this on overleaf and posted to my website log
* Introduction
* Basic question
* What is an approximation to a physics curriculum that is co-optimized between the goals of being both comprehensive (up to the fringe of existing experimental verification, but not necessarily quite rigorous enough to prepare for original research) and efficient?
** Before reviewing t proposed curriculum it would be reasonable to consider the much broader and more comprehensive perspective from [[http://www.staff.science.uu.nl/~hooft101/][Gerard 't Hooft]]: [[http://www.staff.science.uu.nl/~gadda001/goodtheorist/index.html][How to become a GOOD Theoretical Physicist]]
* Global perspective
* I think it is helpful to be aware of the following perspectives before getting started
    A quote regarding the relationship between the local and global structure of theoretical physics
        "All of physics has two aspects: a local or even infinitesimal aspect, and a global aspect. Much of the standard lore deals just with the local and infinitesimal aspects -* the __perturbative__ aspects and [[https://physics.stackexchange.com/a/77412/9269][[file:fiber_bundle.org][fiber bundle]]s play little role there. But they are the all-important structure that governs the global -* the __non-perturbative__ -* aspect. Bundles are the __global__ structure of physical fields and they are irrelevant only for the crude local and perturbative description of reality." [Note: Of course...the latter should not be viewed as a __criticism__ as those are the components that support concrete calculations that make direct contact with the analysis of experiments] --[Urs Schreiber response to physics.stackexchange question: Intuitively, why are bundles so important in Physics?]]
    A paragraph written by Edward Witten p. 280 in the 1986 Proceedings of the International Congress of Mathematicians and on p. 20 in [[file:Physics_and_geometry_by_Edward_Witten_in_1986.org][Physics and geometry by Edward Witten in 1986]] (see below) taken with update from [[https://ericweinstein.org][Eric Weinstein's]], [[https://theportal.wiki/wiki/Graph,_Wall,_Tome][The Portal 'Graph, Wall, Tome project']]
        If one wants to summarize our knowledge of physics in the briefest possible terms, there are really three fundamental observations
            1. Space-time is a pseudo-Riemannian manifold, $$M$$, endowed with a metric tensor and governed by geometrical laws
            2. Over $$M$$ is a principal $$G$$-bundle, $$P_G$$, with a non-Abelian structure group $$G$$
            3. Fermions are sections of $$\hat{S}_+ \otimes V_R \oplus \hat{S}_* \otimes V_{\tilde{R}}$$. $$R$$ and $$\tilde{R}$$ are not isomorphic, but should be complex linear representations of $$G$$
            4. ? Higgs
        All of this must be supplemented with the understanding that the geometrical laws obeyed by the metric tensor, the gauge fields, and the fermions are to be interpreted in quantum mechanical terms.
* Resources
* Written texts (not necessarily in this order)
** Overviews
*** [[file:The_Road_to_Reality_by_Roger_Penrose_in_2004.org][The Road to Reality by Roger Penrose in 2004]]
*** [[file:Physics_from_Symmetry_by_Jakob_Schwichtenberg_in_2015.org][Physics from Symmetry by Jakob Schwichtenberg in 2015]]
** General relativity
*** [[file:A_General_Relativity_Workbook_by_Thomas_Moore_in_2010.org][A General Relativity Workbook by Thomas Moore in 2010]]
*** [[file:Gravitation_by_Misner,_Thorne,_and_Wheeler_in_1970.org][Gravitation by Misner, Thorne, and Wheeler in 1970]]
** Quantum field theory
*** [[file:Quantum_Field_Theory_for_the_Gifted_Amateur_by_Lancaster_and_Blundell_in_2014.org][Quantum Field Theory for the Gifted Amateur by Lancaster and Blundell in 2014]]
** Statistical physics
*** [[file:Introduction_to_dynamical_large_deviations_of_Markov_processes_by_Hugo_Touchette_in_2018.org][Introduction to dynamical large deviations of Markov processes by Hugo Touchette in 2018]]
*** [[file:Master_equations_and_the_theory_of_stochastic_path_integrals_by_Markus_Weber_and_Erwin_Frey_in_2017.org][Master equations and the theory of stochastic path integrals by Markus Weber and Erwin Frey in 2017]]
*** [[file:Renormalization_methods_a_guide_for_beginners_by_McComb_in_2004.org][Renormalization methods a guide for beginners by McComb in 2004]]
*** [[file:Effective_fluctuation_and_response_theory_by_Polettini_and_Esposito_in_2018.org][Effective fluctuation and response theory by Polettini and Esposito in 2018]]
** Symmetry
*** [[file:Notes_on_representation_theory_and_quantum_mechanics_by_Noah_Miller_in_2018.org][Notes on representation theory and quantum mechanics by Noah Miller in 2018]]
*** [[file:Group_theory_in_a_nutshell_for_physicists_by_Anthony_Zee_in_2016.org][Group theory in a nutshell for physicists by Anthony Zee in 2016]]
** Global structure
*** [[file:The_geometry_of_physics_by_Theodore_Frankel_in_2012.org][The geometry of physics by Theodore Frankel in 2012]]
*** [[https://cds.cern.ch/record/181783/files/cer-000093203.pdf)][[file:Physics_and_geometry_by_Edward_Witten_in_1986.org][Physics and geometry by Edward Witten in 1986]] ([link]]
*** [[https://ncatlab.org/nlab/show/geometry+of+physics)][[file:Geometry_of_physics_by_Urs_Schreiber.org][Geometry of physics by Urs Schreiber]] ([link]]
* Lectures
** Overviews
*** [[https://youtu.be/nVO4I3D38O0][Research Skills and Theoretical Physics -* Nima Arkani-Hamed]]
** General relativity
*** [[https://www.youtube.com/playlist?list=PLRlVmXqzHjUQARA37r4Qw3SHPqVXgqO6c][What is a tensor? by XylyXylyX]] 39 videos
*** [[https://www.youtube.com/playlist?list=PLRlVmXqzHjUQHEx63ZFxV-0Ortgf-rpJo][What is a Manifold? by XylyXylyX]] 18 videos
*** [[https://www.youtube.com/playlist?list=PLRlVmXqzHjURQIIebhT7UNTwGQHUEPlsb][What is General Relativity? by XylyXylyX]] 66 videos
*** [[https://www.youtube.com/playlist?list=PLFeEvEPtX_0S6vxxiiNPrJbLu9aK1UVC_)][[file:A_thorough_introduction_to_the_theory_of_general_relativity_by_Frederic_Schuller_in_2015.org][A thorough introduction to the theory of general relativity by Frederic Schuller in 2015]] ([playlist]]
**** [[https://github.com/lazierthanthou/Lecture_Notes_GR][Lecture notes by lazierthanthou]]
** Quantum field theory
*** [[https://www.youtube.com/playlist?list=PLRlVmXqzHjURZO0fviJuyikvKlGS6rXrb][Lie Groups and Lie Algebras by XylyXylyX]] 41 videos
*** [[https://www.youtube.com/playlist?list=PLDfPUNusx1EpRs-wku83aqYSKfR5fFmfS][Quantum field theory by Tobias Osborne]] 18 videos
*** [[https://www.youtube.com/playlist?list=PLDfPUNusx1ErSu1JDVV1KKGQkJQCkzL9u][Advanced Quantum field theory by Tobias Osborne]] 18 videos
** Statistical physics
*** [[https://www.youtube.com/playlist?list=PLUl4u3cNGP60gl3fdUTKRrt5t_GPx2sRg][Statistical mechanics of particles by Mehran Kardar in 2013]]
*** [[https://www.youtube.com/playlist?list=PLUl4u3cNGP63HkEHvYaNJiO0UCUmY0Ts7][Statistical mechanics of fields by Mehran Kardar in 2014]]
*** [[https://www.youtube.com/playlist?list=PLRwcSE2bmyBytsdKY3F4h_v_-PQj8Aa7m][The physics of complex systems by ICTP in 2020]]
*** [[https://www.youtube.com/playlist?list=PL04QVxpjcnjjs7dEO4LY_GZ48peTG1drT][Large deviation theory in statistical physics at ICTP]]
**** Especially the two lectures ([[https://youtu.be/I1PRP14QXVE][part 1]] ; [[https://youtu.be/VLSQ7gt4dwY][part 2]] by [[http://appliedmaths.sun.ac.za/~htouchette/index.html][Hugo Touchette]]
** Global structure
*** [[https://www.youtube.com/playlist?list=PLPH7f_7ZlzxTi6kS4vCmv4ZKm9u8g5yic)][[file:Lectures_on_Geometrical_Anatomy_of_Theoretical_Physics_by_Frederic_Schuller_in_2015.org][Lectures on Geometrical Anatomy of Theoretical Physics by Frederic Schuller in 2015]] ([playlist]]
** Potential directions for future development
*** [[https://www.youtube.com/playlist?list=PLRxtDuSeiaXYy17D56Era8ns3V4vmWmqE][New spaces in Mathematics and Physics by the ERC Project Philosophy of Canonical Quantum Gravity]]
* Evolving pedagogy
* Executable physics for independent verification of understanding concrete computations
** An important goal would be to translate a minimal set of computations from textbook format to an open source computer algebra system such as [Maxima](https://en.wikipedia.org/wiki/Maxima_software) [[file:maxima.org][maxima]] in [Jupyter](https://github.com/robert-dodier/maxima-jupyter) likely making use of [[https://www.vttoth.com/CMS/projects/61-the-maxima-computer-algebra-system][Viktor Toth's up-to-date implementations of atensor, ctensor, itensor]] ( [[http://arxiv.org/abs/cs/0503073)][paper]] )
** Examples that approximate this goal are
*** [[file:Functional_Differential_Geometry_by_Sussman,_Wisom,_and_Farr_in_2013.org][Functional Differential Geometry by Sussman, Wisom, and Farr in 2013]]
*** [[file:Catalogue_of_Spacetimes_by_Mueller_and_Grave_in_2009.org][Catalogue of Spacetimes by Mueller and Grave in 2009]]
