content/posts/An_approximation_to_an_efficient_fundamental_physics_curriculum.md
+++
title = "An approximation to an efficient fundamental physics curriculum"
author = ["Cameron Smith"]
lastmod = 2020-09-24T22:22:29-04:00
slug = "An_approximation_to_an_efficient_fundamental_physics_curriculum"
draft = false
+++

## keywords {#keywords}

-   [learning]({{< relref "learning" >}}), [physics]({{< relref "physics" >}})


## outline {#outline}


### see the latex / pdf version of this on overleaf and posted to my website log {#see-the-latex-pdf-version-of-this-on-overleaf-and-posted-to-my-website-log}


## Introduction {#introduction}


## Basic question {#basic-question}


## What is an approximation to a physics curriculum that is co-optimized between the goals of being both comprehensive (up to the fringe of existing experimental verification, but not necessarily quite rigorous enough to prepare for original research) and efficient? {#what-is-an-approximation-to-a-physics-curriculum-that-is-co-optimized-between-the-goals-of-being-both-comprehensive--up-to-the-fringe-of-existing-experimental-verification-but-not-necessarily-quite-rigorous-enough-to-prepare-for-original-research--and-efficient}


### Before reviewing t proposed curriculum it would be reasonable to consider the much broader and more comprehensive perspective from [Gerard 't Hooft](http://www.staff.science.uu.nl/~hooft101/): [How to become a GOOD Theoretical Physicist](http://www.staff.science.uu.nl/~gadda001/goodtheorist/index.html) {#before-reviewing-t-proposed-curriculum-it-would-be-reasonable-to-consider-the-much-broader-and-more-comprehensive-perspective-from-gerard-t-hooft-how-to-become-a-good-theoretical-physicist}


## Global perspective {#global-perspective}


## I think it is helpful to be aware of the following perspectives before getting started {#i-think-it-is-helpful-to-be-aware-of-the-following-perspectives-before-getting-started}

A quote regarding the relationship between the local and global structure of theoretical physics
    "All of physics has two aspects: a local or even infinitesimal aspect, and a global aspect. Much of the standard lore deals just with the local and infinitesimal aspects -\* the \_\_perturbative\_\_ aspects and [[file:fiber\_bundle.org][fiber bundle](https://physics.stackexchange.com/a/77412/9269)s play little role there. But they are the all-important structure that governs the global -\* the \_\_non-perturbative\_\_ -\* aspect. Bundles are the \_\_global\_\_ structure of physical fields and they are irrelevant only for the crude local and perturbative description of reality." [Note: Of course...the latter should not be viewed as a <span class="underline"><span class="underline">criticism</span></span> as those are the components that support concrete calculations that make direct contact with the analysis of experiments] --[Urs Schreiber response to physics.stackexchange question: Intuitively, why are bundles so important in Physics?]]
A paragraph written by Edward Witten p. 280 in the 1986 Proceedings of the International Congress of Mathematicians and on p. 20 in [Physics and geometry by Edward Witten in 1986]({{< relref "Physics_and_geometry_by_Edward_Witten_in_1986" >}}) (see below) taken with update from [Eric Weinstein's](https://ericweinstein.org), [The Portal 'Graph, Wall, Tome project'](https://theportal.wiki/wiki/Graph,%5FWall,%5FTome)
    If one wants to summarize our knowledge of physics in the briefest possible terms, there are really three fundamental observations

1.  Space-time is a pseudo-Riemannian manifold, \\[M\\], endowed with a metric tensor and governed by geometrical laws
2.  Over \\[M\\] is a principal \\[G\\]-bundle, \\[P\_G\\], with a non-Abelian structure group \\[G\\]
3.  Fermions are sections of \\[\hat{S}\_+ \otimes V\_R \oplus \hat{S}\_\* \otimes V\_{\tilde{R}}\\]. \\[R\\] and \\[\tilde{R}\\] are not isomorphic, but should be complex linear representations of \\[G\\]
4.  ? Higgs

All of this must be supplemented with the understanding that the geometrical laws obeyed by the metric tensor, the gauge fields, and the fermions are to be interpreted in quantum mechanical terms.


## Resources {#resources}


## Written texts (not necessarily in this order) {#written-texts--not-necessarily-in-this-order}


### Overviews {#overviews}

<!--list-separator-->

-  [The Road to Reality by Roger Penrose in 2004]({{< relref "The_Road_to_Reality_by_Roger_Penrose_in_2004" >}})

<!--list-separator-->

-  [Physics from Symmetry by Jakob Schwichtenberg in 2015]({{< relref "Physics_from_Symmetry_by_Jakob_Schwichtenberg_in_2015" >}})


### General relativity {#general-relativity}

<!--list-separator-->

-  [A General Relativity Workbook by Thomas Moore in 2010]({{< relref "A_General_Relativity_Workbook_by_Thomas_Moore_in_2010" >}})

<!--list-separator-->

-  [Gravitation by Misner, Thorne, and Wheeler in 1970]({{< relref "Gravitation_by_Misner,_Thorne,_and_Wheeler_in_1970" >}})


### Quantum field theory {#quantum-field-theory}

<!--list-separator-->

-  [Quantum Field Theory for the Gifted Amateur by Lancaster and Blundell in 2014]({{< relref "Quantum_Field_Theory_for_the_Gifted_Amateur_by_Lancaster_and_Blundell_in_2014" >}})


### Statistical physics {#statistical-physics}

<!--list-separator-->

-  [Introduction to dynamical large deviations of Markov processes by Hugo Touchette in 2018]({{< relref "Introduction_to_dynamical_large_deviations_of_Markov_processes_by_Hugo_Touchette_in_2018" >}})

<!--list-separator-->

-  [Master equations and the theory of stochastic path integrals by Markus Weber and Erwin Frey in 2017]({{< relref "Master_equations_and_the_theory_of_stochastic_path_integrals_by_Markus_Weber_and_Erwin_Frey_in_2017" >}})

<!--list-separator-->

-  [Renormalization methods a guide for beginners by McComb in 2004]({{< relref "Renormalization_methods_a_guide_for_beginners_by_McComb_in_2004" >}})

<!--list-separator-->

-  [Effective fluctuation and response theory by Polettini and Esposito in 2018]({{< relref "Effective_fluctuation_and_response_theory_by_Polettini_and_Esposito_in_2018" >}})


### Symmetry {#symmetry}

<!--list-separator-->

-  [Notes on representation theory and quantum mechanics by Noah Miller in 2018]({{< relref "Notes_on_representation_theory_and_quantum_mechanics_by_Noah_Miller_in_2018" >}})

<!--list-separator-->

-  [Group theory in a nutshell for physicists by Anthony Zee in 2016]({{< relref "Group_theory_in_a_nutshell_for_physicists_by_Anthony_Zee_in_2016" >}})


### Global structure {#global-structure}

<!--list-separator-->

-  [The geometry of physics by Theodore Frankel in 2012]({{< relref "The_geometry_of_physics_by_Theodore_Frankel_in_2012" >}})

<!--list-separator-->

-  [[file:Physics\_and\_geometry\_by\_Edward\_Witten\_in\_1986.org][Physics and geometry by Edward Witten in 1986](https://cds.cern.ch/record/181783/files/cer-000093203.pdf)) ([link]]

<!--list-separator-->

-  [[file:Geometry\_of\_physics\_by\_Urs\_Schreiber.org][Geometry of physics by Urs Schreiber](https://ncatlab.org/nlab/show/geometry+of+physics)) ([link]]


## Lectures {#lectures}


### Overviews {#overviews}

<!--list-separator-->

-  [Research Skills and Theoretical Physics -\* Nima Arkani-Hamed](https://youtu.be/nVO4I3D38O0)


### General relativity {#general-relativity}

<!--list-separator-->

-  [What is a tensor? by XylyXylyX](https://www.youtube.com/playlist?list=PLRlVmXqzHjUQARA37r4Qw3SHPqVXgqO6c) 39 videos

<!--list-separator-->

-  [What is a Manifold? by XylyXylyX](https://www.youtube.com/playlist?list=PLRlVmXqzHjUQHEx63ZFxV-0Ortgf-rpJo) 18 videos

<!--list-separator-->

-  [What is General Relativity? by XylyXylyX](https://www.youtube.com/playlist?list=PLRlVmXqzHjURQIIebhT7UNTwGQHUEPlsb) 66 videos

<!--list-separator-->

-  [[file:A\_thorough\_introduction\_to\_the\_theory\_of\_general\_relativity\_by\_Frederic\_Schuller\_in\_2015.org][A thorough introduction to the theory of general relativity by Frederic Schuller in 2015](https://www.youtube.com/playlist?list=PLFeEvEPtX%5F0S6vxxiiNPrJbLu9aK1UVC%5F)) ([playlist]]

    <!--list-separator-->

    -  [Lecture notes by lazierthanthou](https://github.com/lazierthanthou/Lecture%5FNotes%5FGR)


### Quantum field theory {#quantum-field-theory}

<!--list-separator-->

-  [Lie Groups and Lie Algebras by XylyXylyX](https://www.youtube.com/playlist?list=PLRlVmXqzHjURZO0fviJuyikvKlGS6rXrb) 41 videos

<!--list-separator-->

-  [Quantum field theory by Tobias Osborne](https://www.youtube.com/playlist?list=PLDfPUNusx1EpRs-wku83aqYSKfR5fFmfS) 18 videos

<!--list-separator-->

-  [Advanced Quantum field theory by Tobias Osborne](https://www.youtube.com/playlist?list=PLDfPUNusx1ErSu1JDVV1KKGQkJQCkzL9u) 18 videos


### Statistical physics {#statistical-physics}

<!--list-separator-->

-  [Statistical mechanics of particles by Mehran Kardar in 2013](https://www.youtube.com/playlist?list=PLUl4u3cNGP60gl3fdUTKRrt5t%5FGPx2sRg)

<!--list-separator-->

-  [Statistical mechanics of fields by Mehran Kardar in 2014](https://www.youtube.com/playlist?list=PLUl4u3cNGP63HkEHvYaNJiO0UCUmY0Ts7)

<!--list-separator-->

-  [The physics of complex systems by ICTP in 2020](https://www.youtube.com/playlist?list=PLRwcSE2bmyBytsdKY3F4h%5Fv%5F-PQj8Aa7m)

<!--list-separator-->

-  [Large deviation theory in statistical physics at ICTP](https://www.youtube.com/playlist?list=PL04QVxpjcnjjs7dEO4LY%5FGZ48peTG1drT)

    <!--list-separator-->

    -  Especially the two lectures ([part 1](https://youtu.be/I1PRP14QXVE) ; [part 2](https://youtu.be/VLSQ7gt4dwY) by [Hugo Touchette](http://appliedmaths.sun.ac.za/~htouchette/index.html)


### Global structure {#global-structure}

<!--list-separator-->

-  [[file:Lectures\_on\_Geometrical\_Anatomy\_of\_Theoretical\_Physics\_by\_Frederic\_Schuller\_in\_2015.org][Lectures on Geometrical Anatomy of Theoretical Physics by Frederic Schuller in 2015](https://www.youtube.com/playlist?list=PLPH7f%5F7ZlzxTi6kS4vCmv4ZKm9u8g5yic)) ([playlist]]


### Potential directions for future development {#potential-directions-for-future-development}

<!--list-separator-->

-  [New spaces in Mathematics and Physics by the ERC Project Philosophy of Canonical Quantum Gravity](https://www.youtube.com/playlist?list=PLRxtDuSeiaXYy17D56Era8ns3V4vmWmqE)


## Evolving pedagogy {#evolving-pedagogy}


## Executable physics for independent verification of understanding concrete computations {#executable-physics-for-independent-verification-of-understanding-concrete-computations}


### An important goal would be to translate a minimal set of computations from textbook format to an open source computer algebra system such as [Maxima](<https://en.wikipedia.org/wiki/Maxima%5Fsoftware>) [maxima]({{< relref "maxima" >}}) in [Jupyter](<https://github.com/robert-dodier/maxima-jupyter>) likely making use of [Viktor Toth's up-to-date implementations of atensor, ctensor, itensor](https://www.vttoth.com/CMS/projects/61-the-maxima-computer-algebra-system) ( [paper](http://arxiv.org/abs/cs/0503073)) ) {#an-important-goal-would-be-to-translate-a-minimal-set-of-computations-from-textbook-format-to-an-open-source-computer-algebra-system-such-as-maxima--https-en-dot-wikipedia-dot-org-wiki-maxima-software--maxima--maxima-dot-md--in-jupyter--https-github-dot-com-robert-dodier-maxima-jupyter--likely-making-use-of-viktor-toth-s-up-to-date-implementations-of-atensor-ctensor-itensor--paper}


### Examples that approximate this goal are {#examples-that-approximate-this-goal-are}

<!--list-separator-->

-  [Functional Differential Geometry by Sussman, Wisom, and Farr in 2013]({{< relref "Functional_Differential_Geometry_by_Sussman,_Wisom,_and_Farr_in_2013" >}})

<!--list-separator-->

-  [Catalogue of Spacetimes by Mueller and Grave in 2009]({{< relref "Catalogue_of_Spacetimes_by_Mueller_and_Grave_in_2009" >}})
